rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_SIUL2.h
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG1_EN_MASK   (0x20000U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG1_EN_SHIFT  (17U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG1_EN_WIDTH  (1U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG1_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_TIMER_EN1_EMIOSFLG1_EN_SHIFT)) & SIUL2_MUX0_TIMER_EN1_EMIOSFLG1_EN_MASK)

#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG2_EN_MASK   (0x40000U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG2_EN_SHIFT  (18U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG2_EN_WIDTH  (1U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG2_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_TIMER_EN1_EMIOSFLG2_EN_SHIFT)) & SIUL2_MUX0_TIMER_EN1_EMIOSFLG2_EN_MASK)

#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG3_EN_MASK   (0x80000U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG3_EN_SHIFT  (19U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG3_EN_WIDTH  (1U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG3_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_TIMER_EN1_EMIOSFLG3_EN_SHIFT)) & SIUL2_MUX0_TIMER_EN1_EMIOSFLG3_EN_MASK)

#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG4_EN_MASK   (0x100000U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG4_EN_SHIFT  (20U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG4_EN_WIDTH  (1U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG4_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_TIMER_EN1_EMIOSFLG4_EN_SHIFT)) & SIUL2_MUX0_TIMER_EN1_EMIOSFLG4_EN_MASK)

#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG5_EN_MASK   (0x200000U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG5_EN_SHIFT  (21U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG5_EN_WIDTH  (1U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG5_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_TIMER_EN1_EMIOSFLG5_EN_SHIFT)) & SIUL2_MUX0_TIMER_EN1_EMIOSFLG5_EN_MASK)

#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG6_EN_MASK   (0x400000U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG6_EN_SHIFT  (22U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG6_EN_WIDTH  (1U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG6_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_TIMER_EN1_EMIOSFLG6_EN_SHIFT)) & SIUL2_MUX0_TIMER_EN1_EMIOSFLG6_EN_MASK)

#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG7_EN_MASK   (0x800000U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG7_EN_SHIFT  (23U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG7_EN_WIDTH  (1U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG7_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_TIMER_EN1_EMIOSFLG7_EN_SHIFT)) & SIUL2_MUX0_TIMER_EN1_EMIOSFLG7_EN_MASK)

#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG8_EN_MASK   (0x1000000U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG8_EN_SHIFT  (24U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG8_EN_WIDTH  (1U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG8_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_TIMER_EN1_EMIOSFLG8_EN_SHIFT)) & SIUL2_MUX0_TIMER_EN1_EMIOSFLG8_EN_MASK)

#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG9_EN_MASK   (0x2000000U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG9_EN_SHIFT  (25U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG9_EN_WIDTH  (1U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG9_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_TIMER_EN1_EMIOSFLG9_EN_SHIFT)) & SIUL2_MUX0_TIMER_EN1_EMIOSFLG9_EN_MASK)

#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG10_EN_MASK  (0x4000000U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG10_EN_SHIFT (26U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG10_EN_WIDTH (1U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG10_EN(x)    (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_TIMER_EN1_EMIOSFLG10_EN_SHIFT)) & SIUL2_MUX0_TIMER_EN1_EMIOSFLG10_EN_MASK)

#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG11_EN_MASK  (0x8000000U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG11_EN_SHIFT (27U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG11_EN_WIDTH (1U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG11_EN(x)    (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_TIMER_EN1_EMIOSFLG11_EN_SHIFT)) & SIUL2_MUX0_TIMER_EN1_EMIOSFLG11_EN_MASK)

#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG12_EN_MASK  (0x10000000U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG12_EN_SHIFT (28U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG12_EN_WIDTH (1U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG12_EN(x)    (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_TIMER_EN1_EMIOSFLG12_EN_SHIFT)) & SIUL2_MUX0_TIMER_EN1_EMIOSFLG12_EN_MASK)

#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG13_EN_MASK  (0x20000000U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG13_EN_SHIFT (29U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG13_EN_WIDTH (1U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG13_EN(x)    (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_TIMER_EN1_EMIOSFLG13_EN_SHIFT)) & SIUL2_MUX0_TIMER_EN1_EMIOSFLG13_EN_MASK)

#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG14_EN_MASK  (0x40000000U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG14_EN_SHIFT (30U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG14_EN_WIDTH (1U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG14_EN(x)    (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_TIMER_EN1_EMIOSFLG14_EN_SHIFT)) & SIUL2_MUX0_TIMER_EN1_EMIOSFLG14_EN_MASK)

#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG15_EN_MASK  (0x80000000U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG15_EN_SHIFT (31U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG15_EN_WIDTH (1U)
#define SIUL2_MUX0_TIMER_EN1_EMIOSFLG15_EN(x)    (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_TIMER_EN1_EMIOSFLG15_EN_SHIFT)) & SIUL2_MUX0_TIMER_EN1_EMIOSFLG15_EN_MASK)
/*! @} */

/*! @name MUX0_BCTU1_EN - MUX0_BCTU1_EN */
/*! @{ */

#define SIUL2_MUX0_BCTU1_EN_BCTU1FIFO0DMA_EN_MASK (0x1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1FIFO0DMA_EN_SHIFT (0U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1FIFO0DMA_EN_WIDTH (1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1FIFO0DMA_EN(x)  (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_BCTU1_EN_BCTU1FIFO0DMA_EN_SHIFT)) & SIUL2_MUX0_BCTU1_EN_BCTU1FIFO0DMA_EN_MASK)

#define SIUL2_MUX0_BCTU1_EN_BCTU1FIFO1DMA_EN_MASK (0x2U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1FIFO1DMA_EN_SHIFT (1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1FIFO1DMA_EN_WIDTH (1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1FIFO1DMA_EN(x)  (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_BCTU1_EN_BCTU1FIFO1DMA_EN_SHIFT)) & SIUL2_MUX0_BCTU1_EN_BCTU1FIFO1DMA_EN_MASK)

#define SIUL2_MUX0_BCTU1_EN_BCTU1FIFO2DMA_EN_MASK (0x4U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1FIFO2DMA_EN_SHIFT (2U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1FIFO2DMA_EN_WIDTH (1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1FIFO2DMA_EN(x)  (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_BCTU1_EN_BCTU1FIFO2DMA_EN_SHIFT)) & SIUL2_MUX0_BCTU1_EN_BCTU1FIFO2DMA_EN_MASK)

#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC0DMA_EN_MASK (0x8U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC0DMA_EN_SHIFT (3U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC0DMA_EN_WIDTH (1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC0DMA_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_BCTU1_EN_BCTU1ADC0DMA_EN_SHIFT)) & SIUL2_MUX0_BCTU1_EN_BCTU1ADC0DMA_EN_MASK)

#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC1DMA_EN_MASK (0x10U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC1DMA_EN_SHIFT (4U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC1DMA_EN_WIDTH (1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC1DMA_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_BCTU1_EN_BCTU1ADC1DMA_EN_SHIFT)) & SIUL2_MUX0_BCTU1_EN_BCTU1ADC1DMA_EN_MASK)

#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC2DMA_EN_MASK (0x20U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC2DMA_EN_SHIFT (5U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC2DMA_EN_WIDTH (1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC2DMA_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_BCTU1_EN_BCTU1ADC2DMA_EN_SHIFT)) & SIUL2_MUX0_BCTU1_EN_BCTU1ADC2DMA_EN_MASK)

#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC3DMA_EN_MASK (0x40U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC3DMA_EN_SHIFT (6U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC3DMA_EN_WIDTH (1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1ADC3DMA_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_BCTU1_EN_BCTU1ADC3DMA_EN_SHIFT)) & SIUL2_MUX0_BCTU1_EN_BCTU1ADC3DMA_EN_MASK)

#define SIUL2_MUX0_BCTU1_EN_BCTU1FIFO0INT_EN_MASK (0x80U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1FIFO0INT_EN_SHIFT (7U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1FIFO0INT_EN_WIDTH (1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1FIFO0INT_EN(x)  (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_BCTU1_EN_BCTU1FIFO0INT_EN_SHIFT)) & SIUL2_MUX0_BCTU1_EN_BCTU1FIFO0INT_EN_MASK)

#define SIUL2_MUX0_BCTU1_EN_BCTU1FIFO1INT_EN_MASK (0x100U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1FIFO1INT_EN_SHIFT (8U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1FIFO1INT_EN_WIDTH (1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1FIFO1INT_EN(x)  (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_BCTU1_EN_BCTU1FIFO1INT_EN_SHIFT)) & SIUL2_MUX0_BCTU1_EN_BCTU1FIFO1INT_EN_MASK)

#define SIUL2_MUX0_BCTU1_EN_BCTU1FIFO2INT_EN_MASK (0x200U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1FIFO2INT_EN_SHIFT (9U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1FIFO2INT_EN_WIDTH (1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1FIFO2INT_EN(x)  (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_BCTU1_EN_BCTU1FIFO2INT_EN_SHIFT)) & SIUL2_MUX0_BCTU1_EN_BCTU1FIFO2INT_EN_MASK)

#define SIUL2_MUX0_BCTU1_EN_BCTU1LISTINT_EN_MASK (0x400U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1LISTINT_EN_SHIFT (10U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1LISTINT_EN_WIDTH (1U)
#define SIUL2_MUX0_BCTU1_EN_BCTU1LISTINT_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX0_BCTU1_EN_BCTU1LISTINT_EN_SHIFT)) & SIUL2_MUX0_BCTU1_EN_BCTU1LISTINT_EN_MASK)

