rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_SIUL2.h
#define SIUL2_MUX1_TIMER_EN0_PWM01TRG1_EN_MASK   (0x20U)
#define SIUL2_MUX1_TIMER_EN0_PWM01TRG1_EN_SHIFT  (5U)
#define SIUL2_MUX1_TIMER_EN0_PWM01TRG1_EN_WIDTH  (1U)
#define SIUL2_MUX1_TIMER_EN0_PWM01TRG1_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_TIMER_EN0_PWM01TRG1_EN_SHIFT)) & SIUL2_MUX1_TIMER_EN0_PWM01TRG1_EN_MASK)

#define SIUL2_MUX1_TIMER_EN0_PWM02TRG1_EN_MASK   (0x40U)
#define SIUL2_MUX1_TIMER_EN0_PWM02TRG1_EN_SHIFT  (6U)
#define SIUL2_MUX1_TIMER_EN0_PWM02TRG1_EN_WIDTH  (1U)
#define SIUL2_MUX1_TIMER_EN0_PWM02TRG1_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_TIMER_EN0_PWM02TRG1_EN_SHIFT)) & SIUL2_MUX1_TIMER_EN0_PWM02TRG1_EN_MASK)

#define SIUL2_MUX1_TIMER_EN0_PWM03TRG1_EN_MASK   (0x80U)
#define SIUL2_MUX1_TIMER_EN0_PWM03TRG1_EN_SHIFT  (7U)
#define SIUL2_MUX1_TIMER_EN0_PWM03TRG1_EN_WIDTH  (1U)
#define SIUL2_MUX1_TIMER_EN0_PWM03TRG1_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_TIMER_EN0_PWM03TRG1_EN_SHIFT)) & SIUL2_MUX1_TIMER_EN0_PWM03TRG1_EN_MASK)

#define SIUL2_MUX1_TIMER_EN0_PWM00OUTA_EN_MASK   (0x100U)
#define SIUL2_MUX1_TIMER_EN0_PWM00OUTA_EN_SHIFT  (8U)
#define SIUL2_MUX1_TIMER_EN0_PWM00OUTA_EN_WIDTH  (1U)
#define SIUL2_MUX1_TIMER_EN0_PWM00OUTA_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_TIMER_EN0_PWM00OUTA_EN_SHIFT)) & SIUL2_MUX1_TIMER_EN0_PWM00OUTA_EN_MASK)

#define SIUL2_MUX1_TIMER_EN0_PWM01OUTA_EN_MASK   (0x200U)
#define SIUL2_MUX1_TIMER_EN0_PWM01OUTA_EN_SHIFT  (9U)
#define SIUL2_MUX1_TIMER_EN0_PWM01OUTA_EN_WIDTH  (1U)
#define SIUL2_MUX1_TIMER_EN0_PWM01OUTA_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_TIMER_EN0_PWM01OUTA_EN_SHIFT)) & SIUL2_MUX1_TIMER_EN0_PWM01OUTA_EN_MASK)

#define SIUL2_MUX1_TIMER_EN0_PWM02OUTA_EN_MASK   (0x400U)
#define SIUL2_MUX1_TIMER_EN0_PWM02OUTA_EN_SHIFT  (10U)
#define SIUL2_MUX1_TIMER_EN0_PWM02OUTA_EN_WIDTH  (1U)
#define SIUL2_MUX1_TIMER_EN0_PWM02OUTA_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_TIMER_EN0_PWM02OUTA_EN_SHIFT)) & SIUL2_MUX1_TIMER_EN0_PWM02OUTA_EN_MASK)

#define SIUL2_MUX1_TIMER_EN0_PWM03OUTA_EN_MASK   (0x800U)
#define SIUL2_MUX1_TIMER_EN0_PWM03OUTA_EN_SHIFT  (11U)
#define SIUL2_MUX1_TIMER_EN0_PWM03OUTA_EN_WIDTH  (1U)
#define SIUL2_MUX1_TIMER_EN0_PWM03OUTA_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_TIMER_EN0_PWM03OUTA_EN_SHIFT)) & SIUL2_MUX1_TIMER_EN0_PWM03OUTA_EN_MASK)

#define SIUL2_MUX1_TIMER_EN0_PWM00OUTB_EN_MASK   (0x1000U)
#define SIUL2_MUX1_TIMER_EN0_PWM00OUTB_EN_SHIFT  (12U)
#define SIUL2_MUX1_TIMER_EN0_PWM00OUTB_EN_WIDTH  (1U)
#define SIUL2_MUX1_TIMER_EN0_PWM00OUTB_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_TIMER_EN0_PWM00OUTB_EN_SHIFT)) & SIUL2_MUX1_TIMER_EN0_PWM00OUTB_EN_MASK)

#define SIUL2_MUX1_TIMER_EN0_PWM01OUTB_EN_MASK   (0x2000U)
#define SIUL2_MUX1_TIMER_EN0_PWM01OUTB_EN_SHIFT  (13U)
#define SIUL2_MUX1_TIMER_EN0_PWM01OUTB_EN_WIDTH  (1U)
#define SIUL2_MUX1_TIMER_EN0_PWM01OUTB_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_TIMER_EN0_PWM01OUTB_EN_SHIFT)) & SIUL2_MUX1_TIMER_EN0_PWM01OUTB_EN_MASK)

#define SIUL2_MUX1_TIMER_EN0_PWM02OUTB_EN_MASK   (0x4000U)
#define SIUL2_MUX1_TIMER_EN0_PWM02OUTB_EN_SHIFT  (14U)
#define SIUL2_MUX1_TIMER_EN0_PWM02OUTB_EN_WIDTH  (1U)
#define SIUL2_MUX1_TIMER_EN0_PWM02OUTB_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_TIMER_EN0_PWM02OUTB_EN_SHIFT)) & SIUL2_MUX1_TIMER_EN0_PWM02OUTB_EN_MASK)

#define SIUL2_MUX1_TIMER_EN0_PWM03OUTB_EN_MASK   (0x8000U)
#define SIUL2_MUX1_TIMER_EN0_PWM03OUTB_EN_SHIFT  (15U)
#define SIUL2_MUX1_TIMER_EN0_PWM03OUTB_EN_WIDTH  (1U)
#define SIUL2_MUX1_TIMER_EN0_PWM03OUTB_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_TIMER_EN0_PWM03OUTB_EN_SHIFT)) & SIUL2_MUX1_TIMER_EN0_PWM03OUTB_EN_MASK)

#define SIUL2_MUX1_TIMER_EN0_ADC0EOC_EN_MASK     (0x10000U)
#define SIUL2_MUX1_TIMER_EN0_ADC0EOC_EN_SHIFT    (16U)
#define SIUL2_MUX1_TIMER_EN0_ADC0EOC_EN_WIDTH    (1U)
#define SIUL2_MUX1_TIMER_EN0_ADC0EOC_EN(x)       (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_TIMER_EN0_ADC0EOC_EN_SHIFT)) & SIUL2_MUX1_TIMER_EN0_ADC0EOC_EN_MASK)

#define SIUL2_MUX1_TIMER_EN0_ADC1EOC_EN_MASK     (0x20000U)
#define SIUL2_MUX1_TIMER_EN0_ADC1EOC_EN_SHIFT    (17U)
#define SIUL2_MUX1_TIMER_EN0_ADC1EOC_EN_WIDTH    (1U)
#define SIUL2_MUX1_TIMER_EN0_ADC1EOC_EN(x)       (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_TIMER_EN0_ADC1EOC_EN_SHIFT)) & SIUL2_MUX1_TIMER_EN0_ADC1EOC_EN_MASK)

#define SIUL2_MUX1_TIMER_EN0_ADC2EOC_EN_MASK     (0x40000U)
#define SIUL2_MUX1_TIMER_EN0_ADC2EOC_EN_SHIFT    (18U)
#define SIUL2_MUX1_TIMER_EN0_ADC2EOC_EN_WIDTH    (1U)
#define SIUL2_MUX1_TIMER_EN0_ADC2EOC_EN(x)       (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_TIMER_EN0_ADC2EOC_EN_SHIFT)) & SIUL2_MUX1_TIMER_EN0_ADC2EOC_EN_MASK)

#define SIUL2_MUX1_TIMER_EN0_ADC3EOC_EN_MASK     (0x80000U)
#define SIUL2_MUX1_TIMER_EN0_ADC3EOC_EN_SHIFT    (19U)
#define SIUL2_MUX1_TIMER_EN0_ADC3EOC_EN_WIDTH    (1U)
#define SIUL2_MUX1_TIMER_EN0_ADC3EOC_EN(x)       (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_TIMER_EN0_ADC3EOC_EN_SHIFT)) & SIUL2_MUX1_TIMER_EN0_ADC3EOC_EN_MASK)

#define SIUL2_MUX1_TIMER_EN0_ADC4EOC_EN_MASK     (0x100000U)
#define SIUL2_MUX1_TIMER_EN0_ADC4EOC_EN_SHIFT    (20U)
#define SIUL2_MUX1_TIMER_EN0_ADC4EOC_EN_WIDTH    (1U)
#define SIUL2_MUX1_TIMER_EN0_ADC4EOC_EN(x)       (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_TIMER_EN0_ADC4EOC_EN_SHIFT)) & SIUL2_MUX1_TIMER_EN0_ADC4EOC_EN_MASK)

#define SIUL2_MUX1_TIMER_EN0_ADC5EOC_EN_MASK     (0x200000U)
#define SIUL2_MUX1_TIMER_EN0_ADC5EOC_EN_SHIFT    (21U)
#define SIUL2_MUX1_TIMER_EN0_ADC5EOC_EN_WIDTH    (1U)
#define SIUL2_MUX1_TIMER_EN0_ADC5EOC_EN(x)       (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_TIMER_EN0_ADC5EOC_EN_SHIFT)) & SIUL2_MUX1_TIMER_EN0_ADC5EOC_EN_MASK)

#define SIUL2_MUX1_TIMER_EN0_ADC6EOC_EN_MASK     (0x400000U)
#define SIUL2_MUX1_TIMER_EN0_ADC6EOC_EN_SHIFT    (22U)
#define SIUL2_MUX1_TIMER_EN0_ADC6EOC_EN_WIDTH    (1U)
#define SIUL2_MUX1_TIMER_EN0_ADC6EOC_EN(x)       (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_TIMER_EN0_ADC6EOC_EN_SHIFT)) & SIUL2_MUX1_TIMER_EN0_ADC6EOC_EN_MASK)

#define SIUL2_MUX1_TIMER_EN0_LPUART0TRG_EN_MASK  (0x1000000U)
#define SIUL2_MUX1_TIMER_EN0_LPUART0TRG_EN_SHIFT (24U)
#define SIUL2_MUX1_TIMER_EN0_LPUART0TRG_EN_WIDTH (1U)
#define SIUL2_MUX1_TIMER_EN0_LPUART0TRG_EN(x)    (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_TIMER_EN0_LPUART0TRG_EN_SHIFT)) & SIUL2_MUX1_TIMER_EN0_LPUART0TRG_EN_MASK)

#define SIUL2_MUX1_TIMER_EN0_LPUART1TRG_EN_MASK  (0x2000000U)
#define SIUL2_MUX1_TIMER_EN0_LPUART1TRG_EN_SHIFT (25U)
#define SIUL2_MUX1_TIMER_EN0_LPUART1TRG_EN_WIDTH (1U)
#define SIUL2_MUX1_TIMER_EN0_LPUART1TRG_EN(x)    (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_TIMER_EN0_LPUART1TRG_EN_SHIFT)) & SIUL2_MUX1_TIMER_EN0_LPUART1TRG_EN_MASK)

