rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_SIUL2.h
#define SIUL2_MUX1_MISC_EN_LPUART0TRG_EN_MASK    (0x100U)
#define SIUL2_MUX1_MISC_EN_LPUART0TRG_EN_SHIFT   (8U)
#define SIUL2_MUX1_MISC_EN_LPUART0TRG_EN_WIDTH   (1U)
#define SIUL2_MUX1_MISC_EN_LPUART0TRG_EN(x)      (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_LPUART0TRG_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_LPUART0TRG_EN_MASK)

#define SIUL2_MUX1_MISC_EN_LPUART1TRG_EN_MASK    (0x200U)
#define SIUL2_MUX1_MISC_EN_LPUART1TRG_EN_SHIFT   (9U)
#define SIUL2_MUX1_MISC_EN_LPUART1TRG_EN_WIDTH   (1U)
#define SIUL2_MUX1_MISC_EN_LPUART1TRG_EN(x)      (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_LPUART1TRG_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_LPUART1TRG_EN_MASK)

#define SIUL2_MUX1_MISC_EN_LPUART2TRG_EN_MASK    (0x400U)
#define SIUL2_MUX1_MISC_EN_LPUART2TRG_EN_SHIFT   (10U)
#define SIUL2_MUX1_MISC_EN_LPUART2TRG_EN_WIDTH   (1U)
#define SIUL2_MUX1_MISC_EN_LPUART2TRG_EN(x)      (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_LPUART2TRG_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_LPUART2TRG_EN_MASK)

#define SIUL2_MUX1_MISC_EN_LPUART3TRG_EN_MASK    (0x800U)
#define SIUL2_MUX1_MISC_EN_LPUART3TRG_EN_SHIFT   (11U)
#define SIUL2_MUX1_MISC_EN_LPUART3TRG_EN_WIDTH   (1U)
#define SIUL2_MUX1_MISC_EN_LPUART3TRG_EN(x)      (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_LPUART3TRG_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_LPUART3TRG_EN_MASK)

#define SIUL2_MUX1_MISC_EN_lpi2c_trg_master_MASK (0x1000U)
#define SIUL2_MUX1_MISC_EN_lpi2c_trg_master_SHIFT (12U)
#define SIUL2_MUX1_MISC_EN_lpi2c_trg_master_WIDTH (1U)
#define SIUL2_MUX1_MISC_EN_lpi2c_trg_master(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_lpi2c_trg_master_SHIFT)) & SIUL2_MUX1_MISC_EN_lpi2c_trg_master_MASK)

#define SIUL2_MUX1_MISC_EN_lpi2c_trg_slave_MASK  (0x2000U)
#define SIUL2_MUX1_MISC_EN_lpi2c_trg_slave_SHIFT (13U)
#define SIUL2_MUX1_MISC_EN_lpi2c_trg_slave_WIDTH (1U)
#define SIUL2_MUX1_MISC_EN_lpi2c_trg_slave(x)    (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_lpi2c_trg_slave_SHIFT)) & SIUL2_MUX1_MISC_EN_lpi2c_trg_slave_MASK)

#define SIUL2_MUX1_MISC_EN_lpi2c_1_trg_master_MASK (0x4000U)
#define SIUL2_MUX1_MISC_EN_lpi2c_1_trg_master_SHIFT (14U)
#define SIUL2_MUX1_MISC_EN_lpi2c_1_trg_master_WIDTH (1U)
#define SIUL2_MUX1_MISC_EN_lpi2c_1_trg_master(x) (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_lpi2c_1_trg_master_SHIFT)) & SIUL2_MUX1_MISC_EN_lpi2c_1_trg_master_MASK)

#define SIUL2_MUX1_MISC_EN_lpi2c_1_trg_slave_MASK (0x8000U)
#define SIUL2_MUX1_MISC_EN_lpi2c_1_trg_slave_SHIFT (15U)
#define SIUL2_MUX1_MISC_EN_lpi2c_1_trg_slave_WIDTH (1U)
#define SIUL2_MUX1_MISC_EN_lpi2c_1_trg_slave(x)  (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_lpi2c_1_trg_slave_SHIFT)) & SIUL2_MUX1_MISC_EN_lpi2c_1_trg_slave_MASK)

#define SIUL2_MUX1_MISC_EN_BCTU1FIFO0DMA_EN_MASK (0x10000U)
#define SIUL2_MUX1_MISC_EN_BCTU1FIFO0DMA_EN_SHIFT (16U)
#define SIUL2_MUX1_MISC_EN_BCTU1FIFO0DMA_EN_WIDTH (1U)
#define SIUL2_MUX1_MISC_EN_BCTU1FIFO0DMA_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTU1FIFO0DMA_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTU1FIFO0DMA_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTU1FIFO1DMA_EN_MASK (0x20000U)
#define SIUL2_MUX1_MISC_EN_BCTU1FIFO1DMA_EN_SHIFT (17U)
#define SIUL2_MUX1_MISC_EN_BCTU1FIFO1DMA_EN_WIDTH (1U)
#define SIUL2_MUX1_MISC_EN_BCTU1FIFO1DMA_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTU1FIFO1DMA_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTU1FIFO1DMA_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTU1FIFO2DMA_EN_MASK (0x40000U)
#define SIUL2_MUX1_MISC_EN_BCTU1FIFO2DMA_EN_SHIFT (18U)
#define SIUL2_MUX1_MISC_EN_BCTU1FIFO2DMA_EN_WIDTH (1U)
#define SIUL2_MUX1_MISC_EN_BCTU1FIFO2DMA_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTU1FIFO2DMA_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTU1FIFO2DMA_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTU1ADC0DMA_EN_MASK  (0x80000U)
#define SIUL2_MUX1_MISC_EN_BCTU1ADC0DMA_EN_SHIFT (19U)
#define SIUL2_MUX1_MISC_EN_BCTU1ADC0DMA_EN_WIDTH (1U)
#define SIUL2_MUX1_MISC_EN_BCTU1ADC0DMA_EN(x)    (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTU1ADC0DMA_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTU1ADC0DMA_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTU1ADC1DMA_EN_MASK  (0x100000U)
#define SIUL2_MUX1_MISC_EN_BCTU1ADC1DMA_EN_SHIFT (20U)
#define SIUL2_MUX1_MISC_EN_BCTU1ADC1DMA_EN_WIDTH (1U)
#define SIUL2_MUX1_MISC_EN_BCTU1ADC1DMA_EN(x)    (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTU1ADC1DMA_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTU1ADC1DMA_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTU1ADC2DMA_EN_MASK  (0x200000U)
#define SIUL2_MUX1_MISC_EN_BCTU1ADC2DMA_EN_SHIFT (21U)
#define SIUL2_MUX1_MISC_EN_BCTU1ADC2DMA_EN_WIDTH (1U)
#define SIUL2_MUX1_MISC_EN_BCTU1ADC2DMA_EN(x)    (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTU1ADC2DMA_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTU1ADC2DMA_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTU1ADC3DMA_EN_MASK  (0x400000U)
#define SIUL2_MUX1_MISC_EN_BCTU1ADC3DMA_EN_SHIFT (22U)
#define SIUL2_MUX1_MISC_EN_BCTU1ADC3DMA_EN_WIDTH (1U)
#define SIUL2_MUX1_MISC_EN_BCTU1ADC3DMA_EN(x)    (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTU1ADC3DMA_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTU1ADC3DMA_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTU1FIFO0INT_EN_MASK (0x800000U)
#define SIUL2_MUX1_MISC_EN_BCTU1FIFO0INT_EN_SHIFT (23U)
#define SIUL2_MUX1_MISC_EN_BCTU1FIFO0INT_EN_WIDTH (1U)
#define SIUL2_MUX1_MISC_EN_BCTU1FIFO0INT_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTU1FIFO0INT_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTU1FIFO0INT_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTU1FIFO1INT_EN_MASK (0x1000000U)
#define SIUL2_MUX1_MISC_EN_BCTU1FIFO1INT_EN_SHIFT (24U)
#define SIUL2_MUX1_MISC_EN_BCTU1FIFO1INT_EN_WIDTH (1U)
#define SIUL2_MUX1_MISC_EN_BCTU1FIFO1INT_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTU1FIFO1INT_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTU1FIFO1INT_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTU1FIFO2INT_EN_MASK (0x2000000U)
#define SIUL2_MUX1_MISC_EN_BCTU1FIFO2INT_EN_SHIFT (25U)
#define SIUL2_MUX1_MISC_EN_BCTU1FIFO2INT_EN_WIDTH (1U)
#define SIUL2_MUX1_MISC_EN_BCTU1FIFO2INT_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTU1FIFO2INT_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTU1FIFO2INT_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTU1LISTINT_EN_MASK  (0x4000000U)
#define SIUL2_MUX1_MISC_EN_BCTU1LISTINT_EN_SHIFT (26U)
#define SIUL2_MUX1_MISC_EN_BCTU1LISTINT_EN_WIDTH (1U)
#define SIUL2_MUX1_MISC_EN_BCTU1LISTINT_EN(x)    (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTU1LISTINT_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTU1LISTINT_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTU1ADC0INT_EN_MASK  (0x8000000U)
#define SIUL2_MUX1_MISC_EN_BCTU1ADC0INT_EN_SHIFT (27U)
#define SIUL2_MUX1_MISC_EN_BCTU1ADC0INT_EN_WIDTH (1U)
#define SIUL2_MUX1_MISC_EN_BCTU1ADC0INT_EN(x)    (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTU1ADC0INT_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTU1ADC0INT_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTU1ADC1INT_EN_MASK  (0x10000000U)
#define SIUL2_MUX1_MISC_EN_BCTU1ADC1INT_EN_SHIFT (28U)
#define SIUL2_MUX1_MISC_EN_BCTU1ADC1INT_EN_WIDTH (1U)
#define SIUL2_MUX1_MISC_EN_BCTU1ADC1INT_EN(x)    (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTU1ADC1INT_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTU1ADC1INT_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTU1ADC2INT_EN_MASK  (0x20000000U)
#define SIUL2_MUX1_MISC_EN_BCTU1ADC2INT_EN_SHIFT (29U)
#define SIUL2_MUX1_MISC_EN_BCTU1ADC2INT_EN_WIDTH (1U)
#define SIUL2_MUX1_MISC_EN_BCTU1ADC2INT_EN(x)    (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTU1ADC2INT_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTU1ADC2INT_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTU1ADC3INT_EN_MASK  (0x40000000U)
#define SIUL2_MUX1_MISC_EN_BCTU1ADC3INT_EN_SHIFT (30U)
#define SIUL2_MUX1_MISC_EN_BCTU1ADC3INT_EN_WIDTH (1U)
#define SIUL2_MUX1_MISC_EN_BCTU1ADC3INT_EN(x)    (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTU1ADC3INT_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTU1ADC3INT_EN_MASK)
/*! @} */

