rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_SIUL2.h
#define SIUL2_MUX2_BCTU1_EN_BCTU0FIFO0INT_EN_MASK (0x400000U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0FIFO0INT_EN_SHIFT (22U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0FIFO0INT_EN_WIDTH (1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0FIFO0INT_EN(x)  (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_BCTU1_EN_BCTU0FIFO0INT_EN_SHIFT)) & SIUL2_MUX2_BCTU1_EN_BCTU0FIFO0INT_EN_MASK)

#define SIUL2_MUX2_BCTU1_EN_BCTU0FIFO1INT_EN_MASK (0x800000U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0FIFO1INT_EN_SHIFT (23U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0FIFO1INT_EN_WIDTH (1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0FIFO1INT_EN(x)  (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_BCTU1_EN_BCTU0FIFO1INT_EN_SHIFT)) & SIUL2_MUX2_BCTU1_EN_BCTU0FIFO1INT_EN_MASK)

#define SIUL2_MUX2_BCTU1_EN_BCTU0FIFO2INT_EN_MASK (0x1000000U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0FIFO2INT_EN_SHIFT (24U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0FIFO2INT_EN_WIDTH (1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0FIFO2INT_EN(x)  (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_BCTU1_EN_BCTU0FIFO2INT_EN_SHIFT)) & SIUL2_MUX2_BCTU1_EN_BCTU0FIFO2INT_EN_MASK)

#define SIUL2_MUX2_BCTU1_EN_BCTU0LISTINT_EN_MASK (0x2000000U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0LISTINT_EN_SHIFT (25U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0LISTINT_EN_WIDTH (1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0LISTINT_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_BCTU1_EN_BCTU0LISTINT_EN_SHIFT)) & SIUL2_MUX2_BCTU1_EN_BCTU0LISTINT_EN_MASK)

#define SIUL2_MUX2_BCTU1_EN_BCTU0ADC0INT_EN_MASK (0x4000000U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0ADC0INT_EN_SHIFT (26U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0ADC0INT_EN_WIDTH (1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0ADC0INT_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_BCTU1_EN_BCTU0ADC0INT_EN_SHIFT)) & SIUL2_MUX2_BCTU1_EN_BCTU0ADC0INT_EN_MASK)

#define SIUL2_MUX2_BCTU1_EN_BCTU0ADC1INT_EN_MASK (0x8000000U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0ADC1INT_EN_SHIFT (27U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0ADC1INT_EN_WIDTH (1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0ADC1INT_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_BCTU1_EN_BCTU0ADC1INT_EN_SHIFT)) & SIUL2_MUX2_BCTU1_EN_BCTU0ADC1INT_EN_MASK)

#define SIUL2_MUX2_BCTU1_EN_BCTU0ADC2INT_EN_MASK (0x10000000U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0ADC2INT_EN_SHIFT (28U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0ADC2INT_EN_WIDTH (1U)
#define SIUL2_MUX2_BCTU1_EN_BCTU0ADC2INT_EN(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_BCTU1_EN_BCTU0ADC2INT_EN_SHIFT)) & SIUL2_MUX2_BCTU1_EN_BCTU0ADC2INT_EN_MASK)
/*! @} */

/*! @name MUX2_MISC_EN - MUX2_MISC_EN */
/*! @{ */

#define SIUL2_MUX2_MISC_EN_ADC0EOC_EN_MASK       (0x1U)
#define SIUL2_MUX2_MISC_EN_ADC0EOC_EN_SHIFT      (0U)
#define SIUL2_MUX2_MISC_EN_ADC0EOC_EN_WIDTH      (1U)
#define SIUL2_MUX2_MISC_EN_ADC0EOC_EN(x)         (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_MISC_EN_ADC0EOC_EN_SHIFT)) & SIUL2_MUX2_MISC_EN_ADC0EOC_EN_MASK)

#define SIUL2_MUX2_MISC_EN_ADC1EOC_EN_MASK       (0x2U)
#define SIUL2_MUX2_MISC_EN_ADC1EOC_EN_SHIFT      (1U)
#define SIUL2_MUX2_MISC_EN_ADC1EOC_EN_WIDTH      (1U)
#define SIUL2_MUX2_MISC_EN_ADC1EOC_EN(x)         (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_MISC_EN_ADC1EOC_EN_SHIFT)) & SIUL2_MUX2_MISC_EN_ADC1EOC_EN_MASK)

#define SIUL2_MUX2_MISC_EN_ADC2EOC_EN_MASK       (0x4U)
#define SIUL2_MUX2_MISC_EN_ADC2EOC_EN_SHIFT      (2U)
#define SIUL2_MUX2_MISC_EN_ADC2EOC_EN_WIDTH      (1U)
#define SIUL2_MUX2_MISC_EN_ADC2EOC_EN(x)         (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_MISC_EN_ADC2EOC_EN_SHIFT)) & SIUL2_MUX2_MISC_EN_ADC2EOC_EN_MASK)

#define SIUL2_MUX2_MISC_EN_ADC3EOC_EN_MASK       (0x8U)
#define SIUL2_MUX2_MISC_EN_ADC3EOC_EN_SHIFT      (3U)
#define SIUL2_MUX2_MISC_EN_ADC3EOC_EN_WIDTH      (1U)
#define SIUL2_MUX2_MISC_EN_ADC3EOC_EN(x)         (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_MISC_EN_ADC3EOC_EN_SHIFT)) & SIUL2_MUX2_MISC_EN_ADC3EOC_EN_MASK)

#define SIUL2_MUX2_MISC_EN_ADC4EOC_EN_MASK       (0x10U)
#define SIUL2_MUX2_MISC_EN_ADC4EOC_EN_SHIFT      (4U)
#define SIUL2_MUX2_MISC_EN_ADC4EOC_EN_WIDTH      (1U)
#define SIUL2_MUX2_MISC_EN_ADC4EOC_EN(x)         (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_MISC_EN_ADC4EOC_EN_SHIFT)) & SIUL2_MUX2_MISC_EN_ADC4EOC_EN_MASK)

#define SIUL2_MUX2_MISC_EN_ADC5EOC_EN_MASK       (0x20U)
#define SIUL2_MUX2_MISC_EN_ADC5EOC_EN_SHIFT      (5U)
#define SIUL2_MUX2_MISC_EN_ADC5EOC_EN_WIDTH      (1U)
#define SIUL2_MUX2_MISC_EN_ADC5EOC_EN(x)         (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_MISC_EN_ADC5EOC_EN_SHIFT)) & SIUL2_MUX2_MISC_EN_ADC5EOC_EN_MASK)

#define SIUL2_MUX2_MISC_EN_ADC6EOC_EN_MASK       (0x40U)
#define SIUL2_MUX2_MISC_EN_ADC6EOC_EN_SHIFT      (6U)
#define SIUL2_MUX2_MISC_EN_ADC6EOC_EN_WIDTH      (1U)
#define SIUL2_MUX2_MISC_EN_ADC6EOC_EN(x)         (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_MISC_EN_ADC6EOC_EN_SHIFT)) & SIUL2_MUX2_MISC_EN_ADC6EOC_EN_MASK)

#define SIUL2_MUX2_MISC_EN_LPUART0TRG_EN_MASK    (0x100U)
#define SIUL2_MUX2_MISC_EN_LPUART0TRG_EN_SHIFT   (8U)
#define SIUL2_MUX2_MISC_EN_LPUART0TRG_EN_WIDTH   (1U)
#define SIUL2_MUX2_MISC_EN_LPUART0TRG_EN(x)      (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_MISC_EN_LPUART0TRG_EN_SHIFT)) & SIUL2_MUX2_MISC_EN_LPUART0TRG_EN_MASK)

#define SIUL2_MUX2_MISC_EN_LPUART1TRG_EN_MASK    (0x200U)
#define SIUL2_MUX2_MISC_EN_LPUART1TRG_EN_SHIFT   (9U)
#define SIUL2_MUX2_MISC_EN_LPUART1TRG_EN_WIDTH   (1U)
#define SIUL2_MUX2_MISC_EN_LPUART1TRG_EN(x)      (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_MISC_EN_LPUART1TRG_EN_SHIFT)) & SIUL2_MUX2_MISC_EN_LPUART1TRG_EN_MASK)

#define SIUL2_MUX2_MISC_EN_LPUART2TRG_EN_MASK    (0x400U)
#define SIUL2_MUX2_MISC_EN_LPUART2TRG_EN_SHIFT   (10U)
#define SIUL2_MUX2_MISC_EN_LPUART2TRG_EN_WIDTH   (1U)
#define SIUL2_MUX2_MISC_EN_LPUART2TRG_EN(x)      (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_MISC_EN_LPUART2TRG_EN_SHIFT)) & SIUL2_MUX2_MISC_EN_LPUART2TRG_EN_MASK)

#define SIUL2_MUX2_MISC_EN_LPUART3TRG_EN_MASK    (0x800U)
#define SIUL2_MUX2_MISC_EN_LPUART3TRG_EN_SHIFT   (11U)
#define SIUL2_MUX2_MISC_EN_LPUART3TRG_EN_WIDTH   (1U)
#define SIUL2_MUX2_MISC_EN_LPUART3TRG_EN(x)      (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_MISC_EN_LPUART3TRG_EN_SHIFT)) & SIUL2_MUX2_MISC_EN_LPUART3TRG_EN_MASK)

#define SIUL2_MUX2_MISC_EN_lpi2c_trg_master_MASK (0x1000U)
#define SIUL2_MUX2_MISC_EN_lpi2c_trg_master_SHIFT (12U)
#define SIUL2_MUX2_MISC_EN_lpi2c_trg_master_WIDTH (1U)
#define SIUL2_MUX2_MISC_EN_lpi2c_trg_master(x)   (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX2_MISC_EN_lpi2c_trg_master_SHIFT)) & SIUL2_MUX2_MISC_EN_lpi2c_trg_master_MASK)

