rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_SIUL2.h
#define SIUL2_GPDO155_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO155_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO155_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO155_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO155_PDO_n_SHIFT)) & SIUL2_GPDO155_PDO_n_MASK)
/*! @} */

/*! @name GPDO154 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO154_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO154_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO154_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO154_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO154_PDO_n_SHIFT)) & SIUL2_GPDO154_PDO_n_MASK)
/*! @} */

/*! @name GPDO159 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO159_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO159_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO159_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO159_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO159_PDO_n_SHIFT)) & SIUL2_GPDO159_PDO_n_MASK)
/*! @} */

/*! @name GPDO158 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO158_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO158_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO158_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO158_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO158_PDO_n_SHIFT)) & SIUL2_GPDO158_PDO_n_MASK)
/*! @} */

/*! @name GPDO157 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO157_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO157_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO157_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO157_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO157_PDO_n_SHIFT)) & SIUL2_GPDO157_PDO_n_MASK)
/*! @} */

/*! @name GPDO156 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO156_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO156_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO156_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO156_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO156_PDO_n_SHIFT)) & SIUL2_GPDO156_PDO_n_MASK)
/*! @} */

/*! @name GPDO163 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO163_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO163_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO163_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO163_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO163_PDO_n_SHIFT)) & SIUL2_GPDO163_PDO_n_MASK)
/*! @} */

/*! @name GPDO162 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO162_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO162_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO162_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO162_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO162_PDO_n_SHIFT)) & SIUL2_GPDO162_PDO_n_MASK)
/*! @} */

/*! @name GPDO161 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO161_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO161_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO161_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO161_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO161_PDO_n_SHIFT)) & SIUL2_GPDO161_PDO_n_MASK)
/*! @} */

/*! @name GPDO160 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO160_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO160_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO160_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO160_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO160_PDO_n_SHIFT)) & SIUL2_GPDO160_PDO_n_MASK)
/*! @} */

/*! @name GPDO167 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO167_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO167_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO167_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO167_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO167_PDO_n_SHIFT)) & SIUL2_GPDO167_PDO_n_MASK)
/*! @} */

/*! @name GPDO166 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO166_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO166_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO166_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO166_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO166_PDO_n_SHIFT)) & SIUL2_GPDO166_PDO_n_MASK)
/*! @} */

/*! @name GPDO165 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO165_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO165_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO165_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO165_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO165_PDO_n_SHIFT)) & SIUL2_GPDO165_PDO_n_MASK)
/*! @} */

/*! @name GPDO164 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO164_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO164_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO164_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO164_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO164_PDO_n_SHIFT)) & SIUL2_GPDO164_PDO_n_MASK)
/*! @} */

/*! @name GPDO171 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO171_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO171_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO171_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO171_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO171_PDO_n_SHIFT)) & SIUL2_GPDO171_PDO_n_MASK)
/*! @} */

/*! @name GPDO170 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO170_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO170_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO170_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO170_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO170_PDO_n_SHIFT)) & SIUL2_GPDO170_PDO_n_MASK)
/*! @} */

/*! @name GPDO169 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO169_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO169_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO169_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO169_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO169_PDO_n_SHIFT)) & SIUL2_GPDO169_PDO_n_MASK)
/*! @} */

/*! @name GPDO168 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO168_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO168_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO168_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO168_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO168_PDO_n_SHIFT)) & SIUL2_GPDO168_PDO_n_MASK)
/*! @} */

/*! @name GPDO175 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO175_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO175_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO175_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO175_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO175_PDO_n_SHIFT)) & SIUL2_GPDO175_PDO_n_MASK)
/*! @} */

/*! @name GPDO174 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO174_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO174_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO174_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO174_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO174_PDO_n_SHIFT)) & SIUL2_GPDO174_PDO_n_MASK)
/*! @} */

/*! @name GPDO173 - SIUL2 GPIO Pad Data Output */
/*! @{ */

