rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_SIUL2.h
/*! @name GPDO208 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO208_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO208_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO208_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO208_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO208_PDO_n_SHIFT)) & SIUL2_GPDO208_PDO_n_MASK)
/*! @} */

/*! @name GPDO215 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO215_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO215_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO215_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO215_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO215_PDO_n_SHIFT)) & SIUL2_GPDO215_PDO_n_MASK)
/*! @} */

/*! @name GPDO214 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO214_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO214_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO214_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO214_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO214_PDO_n_SHIFT)) & SIUL2_GPDO214_PDO_n_MASK)
/*! @} */

/*! @name GPDO213 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO213_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO213_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO213_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO213_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO213_PDO_n_SHIFT)) & SIUL2_GPDO213_PDO_n_MASK)
/*! @} */

/*! @name GPDO212 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO212_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO212_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO212_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO212_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO212_PDO_n_SHIFT)) & SIUL2_GPDO212_PDO_n_MASK)
/*! @} */

/*! @name GPDO219 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO219_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO219_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO219_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO219_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO219_PDO_n_SHIFT)) & SIUL2_GPDO219_PDO_n_MASK)
/*! @} */

/*! @name GPDO218 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO218_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO218_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO218_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO218_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO218_PDO_n_SHIFT)) & SIUL2_GPDO218_PDO_n_MASK)
/*! @} */

/*! @name GPDO217 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO217_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO217_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO217_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO217_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO217_PDO_n_SHIFT)) & SIUL2_GPDO217_PDO_n_MASK)
/*! @} */

/*! @name GPDO216 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO216_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO216_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO216_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO216_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO216_PDO_n_SHIFT)) & SIUL2_GPDO216_PDO_n_MASK)
/*! @} */

/*! @name GPDO231 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO231_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO231_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO231_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO231_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO231_PDO_n_SHIFT)) & SIUL2_GPDO231_PDO_n_MASK)
/*! @} */

/*! @name GPDO235 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO235_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO235_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO235_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO235_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO235_PDO_n_SHIFT)) & SIUL2_GPDO235_PDO_n_MASK)
/*! @} */

/*! @name GPDO234 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO234_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO234_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO234_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO234_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO234_PDO_n_SHIFT)) & SIUL2_GPDO234_PDO_n_MASK)
/*! @} */

/*! @name GPDO233 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO233_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO233_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO233_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO233_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO233_PDO_n_SHIFT)) & SIUL2_GPDO233_PDO_n_MASK)
/*! @} */

/*! @name GPDO232 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO232_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO232_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO232_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO232_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO232_PDO_n_SHIFT)) & SIUL2_GPDO232_PDO_n_MASK)
/*! @} */

/*! @name GPDO236 - SIUL2 GPIO Pad Data Output */
/*! @{ */

#define SIUL2_GPDO236_PDO_n_MASK                 (0x1U)
#define SIUL2_GPDO236_PDO_n_SHIFT                (0U)
#define SIUL2_GPDO236_PDO_n_WIDTH                (1U)
#define SIUL2_GPDO236_PDO_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDO236_PDO_n_SHIFT)) & SIUL2_GPDO236_PDO_n_MASK)
/*! @} */

/*! @name GPDI3 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI3_PDI_n_MASK                   (0x1U)
#define SIUL2_GPDI3_PDI_n_SHIFT                  (0U)
#define SIUL2_GPDI3_PDI_n_WIDTH                  (1U)
#define SIUL2_GPDI3_PDI_n(x)                     (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI3_PDI_n_SHIFT)) & SIUL2_GPDI3_PDI_n_MASK)
/*! @} */

/*! @name GPDI2 - SIUL2 GPIO Pad Data Input */
/*! @{ */

#define SIUL2_GPDI2_PDI_n_MASK                   (0x1U)
#define SIUL2_GPDI2_PDI_n_SHIFT                  (0U)
#define SIUL2_GPDI2_PDI_n_WIDTH                  (1U)
#define SIUL2_GPDI2_PDI_n(x)                     (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI2_PDI_n_SHIFT)) & SIUL2_GPDI2_PDI_n_MASK)
/*! @} */

/*! @name GPDI1 - SIUL2 GPIO Pad Data Input */
/*! @{ */

