rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_SIUL2.h
#define SIUL2_PGPDI13_PPDI9_MASK                 (0x200U)
#define SIUL2_PGPDI13_PPDI9_SHIFT                (9U)
#define SIUL2_PGPDI13_PPDI9_WIDTH                (1U)
#define SIUL2_PGPDI13_PPDI9(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI13_PPDI9_SHIFT)) & SIUL2_PGPDI13_PPDI9_MASK)

#define SIUL2_PGPDI13_PPDI10_MASK                (0x400U)
#define SIUL2_PGPDI13_PPDI10_SHIFT               (10U)
#define SIUL2_PGPDI13_PPDI10_WIDTH               (1U)
#define SIUL2_PGPDI13_PPDI10(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI13_PPDI10_SHIFT)) & SIUL2_PGPDI13_PPDI10_MASK)

#define SIUL2_PGPDI13_PPDI11_MASK                (0x800U)
#define SIUL2_PGPDI13_PPDI11_SHIFT               (11U)
#define SIUL2_PGPDI13_PPDI11_WIDTH               (1U)
#define SIUL2_PGPDI13_PPDI11(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI13_PPDI11_SHIFT)) & SIUL2_PGPDI13_PPDI11_MASK)

#define SIUL2_PGPDI13_PPDI12_MASK                (0x1000U)
#define SIUL2_PGPDI13_PPDI12_SHIFT               (12U)
#define SIUL2_PGPDI13_PPDI12_WIDTH               (1U)
#define SIUL2_PGPDI13_PPDI12(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI13_PPDI12_SHIFT)) & SIUL2_PGPDI13_PPDI12_MASK)

#define SIUL2_PGPDI13_PPDI13_MASK                (0x2000U)
#define SIUL2_PGPDI13_PPDI13_SHIFT               (13U)
#define SIUL2_PGPDI13_PPDI13_WIDTH               (1U)
#define SIUL2_PGPDI13_PPDI13(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI13_PPDI13_SHIFT)) & SIUL2_PGPDI13_PPDI13_MASK)

#define SIUL2_PGPDI13_PPDI14_MASK                (0x4000U)
#define SIUL2_PGPDI13_PPDI14_SHIFT               (14U)
#define SIUL2_PGPDI13_PPDI14_WIDTH               (1U)
#define SIUL2_PGPDI13_PPDI14(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI13_PPDI14_SHIFT)) & SIUL2_PGPDI13_PPDI14_MASK)

#define SIUL2_PGPDI13_PPDI15_MASK                (0x8000U)
#define SIUL2_PGPDI13_PPDI15_SHIFT               (15U)
#define SIUL2_PGPDI13_PPDI15_WIDTH               (1U)
#define SIUL2_PGPDI13_PPDI15(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI13_PPDI15_SHIFT)) & SIUL2_PGPDI13_PPDI15_MASK)
/*! @} */

/*! @name PGPDI12 - SIUL2 Parallel GPIO Pad Data In */
/*! @{ */

#define SIUL2_PGPDI12_PPDI0_MASK                 (0x1U)
#define SIUL2_PGPDI12_PPDI0_SHIFT                (0U)
#define SIUL2_PGPDI12_PPDI0_WIDTH                (1U)
#define SIUL2_PGPDI12_PPDI0(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI12_PPDI0_SHIFT)) & SIUL2_PGPDI12_PPDI0_MASK)

#define SIUL2_PGPDI12_PPDI1_MASK                 (0x2U)
#define SIUL2_PGPDI12_PPDI1_SHIFT                (1U)
#define SIUL2_PGPDI12_PPDI1_WIDTH                (1U)
#define SIUL2_PGPDI12_PPDI1(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI12_PPDI1_SHIFT)) & SIUL2_PGPDI12_PPDI1_MASK)

#define SIUL2_PGPDI12_PPDI2_MASK                 (0x4U)
#define SIUL2_PGPDI12_PPDI2_SHIFT                (2U)
#define SIUL2_PGPDI12_PPDI2_WIDTH                (1U)
#define SIUL2_PGPDI12_PPDI2(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI12_PPDI2_SHIFT)) & SIUL2_PGPDI12_PPDI2_MASK)

#define SIUL2_PGPDI12_PPDI3_MASK                 (0x8U)
#define SIUL2_PGPDI12_PPDI3_SHIFT                (3U)
#define SIUL2_PGPDI12_PPDI3_WIDTH                (1U)
#define SIUL2_PGPDI12_PPDI3(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI12_PPDI3_SHIFT)) & SIUL2_PGPDI12_PPDI3_MASK)

#define SIUL2_PGPDI12_PPDI4_MASK                 (0x10U)
#define SIUL2_PGPDI12_PPDI4_SHIFT                (4U)
#define SIUL2_PGPDI12_PPDI4_WIDTH                (1U)
#define SIUL2_PGPDI12_PPDI4(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI12_PPDI4_SHIFT)) & SIUL2_PGPDI12_PPDI4_MASK)

#define SIUL2_PGPDI12_PPDI5_MASK                 (0x20U)
#define SIUL2_PGPDI12_PPDI5_SHIFT                (5U)
#define SIUL2_PGPDI12_PPDI5_WIDTH                (1U)
#define SIUL2_PGPDI12_PPDI5(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI12_PPDI5_SHIFT)) & SIUL2_PGPDI12_PPDI5_MASK)

#define SIUL2_PGPDI12_PPDI6_MASK                 (0x40U)
#define SIUL2_PGPDI12_PPDI6_SHIFT                (6U)
#define SIUL2_PGPDI12_PPDI6_WIDTH                (1U)
#define SIUL2_PGPDI12_PPDI6(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI12_PPDI6_SHIFT)) & SIUL2_PGPDI12_PPDI6_MASK)

#define SIUL2_PGPDI12_PPDI7_MASK                 (0x80U)
#define SIUL2_PGPDI12_PPDI7_SHIFT                (7U)
#define SIUL2_PGPDI12_PPDI7_WIDTH                (1U)
#define SIUL2_PGPDI12_PPDI7(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI12_PPDI7_SHIFT)) & SIUL2_PGPDI12_PPDI7_MASK)

#define SIUL2_PGPDI12_PPDI8_MASK                 (0x100U)
#define SIUL2_PGPDI12_PPDI8_SHIFT                (8U)
#define SIUL2_PGPDI12_PPDI8_WIDTH                (1U)
#define SIUL2_PGPDI12_PPDI8(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI12_PPDI8_SHIFT)) & SIUL2_PGPDI12_PPDI8_MASK)

#define SIUL2_PGPDI12_PPDI9_MASK                 (0x200U)
#define SIUL2_PGPDI12_PPDI9_SHIFT                (9U)
#define SIUL2_PGPDI12_PPDI9_WIDTH                (1U)
#define SIUL2_PGPDI12_PPDI9(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI12_PPDI9_SHIFT)) & SIUL2_PGPDI12_PPDI9_MASK)

#define SIUL2_PGPDI12_PPDI10_MASK                (0x400U)
#define SIUL2_PGPDI12_PPDI10_SHIFT               (10U)
#define SIUL2_PGPDI12_PPDI10_WIDTH               (1U)
#define SIUL2_PGPDI12_PPDI10(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI12_PPDI10_SHIFT)) & SIUL2_PGPDI12_PPDI10_MASK)

#define SIUL2_PGPDI12_PPDI11_MASK                (0x800U)
#define SIUL2_PGPDI12_PPDI11_SHIFT               (11U)
#define SIUL2_PGPDI12_PPDI11_WIDTH               (1U)
#define SIUL2_PGPDI12_PPDI11(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI12_PPDI11_SHIFT)) & SIUL2_PGPDI12_PPDI11_MASK)

#define SIUL2_PGPDI12_PPDI12_MASK                (0x1000U)
#define SIUL2_PGPDI12_PPDI12_SHIFT               (12U)
#define SIUL2_PGPDI12_PPDI12_WIDTH               (1U)
#define SIUL2_PGPDI12_PPDI12(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI12_PPDI12_SHIFT)) & SIUL2_PGPDI12_PPDI12_MASK)

#define SIUL2_PGPDI12_PPDI13_MASK                (0x2000U)
#define SIUL2_PGPDI12_PPDI13_SHIFT               (13U)
#define SIUL2_PGPDI12_PPDI13_WIDTH               (1U)
#define SIUL2_PGPDI12_PPDI13(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI12_PPDI13_SHIFT)) & SIUL2_PGPDI12_PPDI13_MASK)

#define SIUL2_PGPDI12_PPDI14_MASK                (0x4000U)
#define SIUL2_PGPDI12_PPDI14_SHIFT               (14U)
#define SIUL2_PGPDI12_PPDI14_WIDTH               (1U)
#define SIUL2_PGPDI12_PPDI14(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI12_PPDI14_SHIFT)) & SIUL2_PGPDI12_PPDI14_MASK)

#define SIUL2_PGPDI12_PPDI15_MASK                (0x8000U)
#define SIUL2_PGPDI12_PPDI15_SHIFT               (15U)
#define SIUL2_PGPDI12_PPDI15_WIDTH               (1U)
#define SIUL2_PGPDI12_PPDI15(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDI12_PPDI15_SHIFT)) & SIUL2_PGPDI12_PPDI15_MASK)
/*! @} */

/*! @name PGPDI14 - SIUL2 Parallel GPIO Pad Data In */
/*! @{ */

